# константа максимальной длины почтового адреса
MAX_LEN_EMAIL: int = 254

# константа максимальной длины имени, фамилии, никнейма пользоввателя
MAX_LEN_NAME: int = 150

# константа максимальной длины названия ингредиента, единицы
# измерения ингредиента, названия тега, слага, названия рецепта
MAX_LEN_TITLE: int = 200

# константа минимального времени приготовления рецепта в минутах
MIN_VALUE: int = 1

# константа максимального времени приготовления рецепта в минутах
MAX_VALUE: int = 32767

# константа максимальной длины HEX-кода
MAX_HEX: int = 7

# константы вспомогательного текста
EMAIL_HELP_TEXT: str = "Введите вашу электронную почту"
FIRST_NAME_HELP_TEXT: str = "Введите ваше имя"
LAST_NAME_HELP_TEXT: str = "Введите вашу фамилию"
USERNAME_HELP_TEXT: str = "Введите уникальное имя пользователя"
ING_HELP_TEXT: str = "Введите название ингредиента"
UNIT_HELP_TEXT: str = "Введите единицу измерения ингредиента"
TAG_HELP_TEXT: str = "Введите название тега"
COLOR_HELP_TEXT: str = "Введите HEX-код цвета тега"
SLUG_HELP_TEXT: str = "Введите уникальный идентификатор тега"
RECIPE_HELP_TEXT: str = "Введите название рецепта"
AUTHOR_HELP_TEXT: str = "Выберите автора рецепта"
IMAGE_HELP_TEXT: str = "Загрузите изображение рецепта"
TEXT_HELP_TEXT: str = "Введите описание рецепта"
TIME_HELP_TEXT: str = "Введите время приготовления рецепта в минутах"
RECIPE_TAGS: str = "Выберите теги для рецепта"
RECIPE_ING: str = "Выберите ингредиенты для рецепта и укажите их количество"
AMOUNT_ING: str = "Выберите рецепт, к которому относится ингредиент"
ING_USE: str = "Выберите ингредиент, который используется в рецепте"
AMOUNT_ING_UNIT: str = "Введите количество ингредиента в единицах измерения"
